---
kind: type
id: T:Autodesk.Revit.DB.Architecture.RailingSlopeOption
source: html/5399a679-85e7-9d6d-2ed3-f82f5bfe2785.htm
---
# Autodesk.Revit.DB.Architecture.RailingSlopeOption

The option determines the slope of the railing.

## Syntax (C#)
```csharp
public enum RailingSlopeOption
```